const cities = {
    "Біла Церква": {
        "Бердянськ": 3,
        "Вінниця": 1,
        "Дніпро": 2,
        "Житомир": 1,
        "Запоріжжя": 2,
        "Івано-Франківськ": 2,
        "Кам’янець Подільский": 2,
        "Київ": 1,
        "Кременчуг": 1,
        "Кривий Ріг": 2,
        "Кропивницький": 1,
        "Луцьк": 2,
        "Львів": 2,
        "Маріуполь": 3,
        "Мелітополь": 3,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 2,
        "Слов’янськ": 3,
        "Суми": 2,
        "Тернопіль": 2,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 2,
        "Хмельницький": 1,
        "Черкаси": 1,
        "Чернігів": 1,
        "Чернівці": 2
    },
    "Бердянськ": {
        "Біла Церква": 3,
        "Вінниця": 4,
        "Дніпро": 1,
        "Житомир": 4,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 3,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 1,
        "Мелітополь": 1,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 4,
        "Слов’янськ": 2,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 2,
        "Хмельницький": 4,
        "Черкаси": 2,
        "Чернігів": 4,
        "Чернівці": 4
    },
    "Вінниця": {
        "Біла Церква": 1,
        "Бердянськ": 4,
        "Дніпро": 2,
        "Житомир": 1,
        "Запоріжжя": 3,
        "Івано-Франківськ": 2,
        "Кам’янець Подільский": 1,
        "Київ": 1,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 1,
        "Луцьк": 2,
        "Львів": 4,
        "Маріуполь": 4,
        "Мелітополь": 3,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 2,
        "Тернопіль": 1,
        "Ужгород": 3,
        "Харків": 3,
        "Херсон": 2,
        "Хмельницький": 1,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 1
    },
    "Дніпро": {
        "Біла Церква": 2,
        "Бердянськ": 1,
        "Вінниця": 2,
        "Житомир": 3,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 1,
        "Мелітополь": 1,
        "Миколаїв": 1,
        "Одеса": 2,
        "Полтава": 1,
        "Рівне": 4,
        "Слов’янськ": 1,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 1,
        "Хмельницький": 3,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 4
    },
    "Житомир": {
        "Біла Церква": 1,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 3,
        "Запоріжжя": 3,
        "Івано-Франківськ": 2,
        "Кам’янець Подільский": 1,
        "Київ": 1,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 1,
        "Львів": 2,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 2,
        "Тернопіль": 1,
        "Ужгород": 3,
        "Харків": 3,
        "Херсон": 3,
        "Хмельницький": 1,
        "Черкаси": 1,
        "Чернігів": 1,
        "Чернівці": 2
    },
    "Запоріжжя": {
        "Біла Церква": 2,
        "Бердянськ": 1,
        "Вінниця": 3,
        "Дніпро": 1,
        "Житомир": 3,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 1,
        "Мелітополь": 1,
        "Миколаїв": 3,
        "Одеса": 2,
        "Полтава": 1,
        "Рівне": 4,
        "Слов’янськ": 1,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 2,
        "Хмельницький": 3,
        "Черкаси": 2,
        "Чернігів": 3,
        "Чернівці": 4
    },
    "Івано-Франківськ": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 2,
        "Дніпро": 4,
        "Житомир": 2,
        "Запоріжжя": 4,
        "Кам’янець Подільский": 1,
        "Київ": 2,
        "Кременчуг": 4,
        "Кривий Ріг": 4,
        "Кропивницький": 3,
        "Луцьк": 1,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 4,
        "Одеса": 3,
        "Полтава": 4,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 4,
        "Тернопіль": 1,
        "Ужгород": 1,
        "Харків": 4,
        "Херсон": 4,
        "Хмельницький": 1,
        "Черкаси": 3,
        "Чернігів": 3,
        "Чернівці": 1
    },
    "Кам’янець Подільский": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 3,
        "Житомир": 1,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Київ": 2,
        "Кременчуг": 3,
        "Кривий Ріг": 3,
        "Кропивницький": 2,
        "Луцьк": 1,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 3,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 3,
        "Тернопіль": 1,
        "Ужгород": 2,
        "Харків": 4,
        "Херсон": 3,
        "Хмельницький": 1,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 1
    },
    "Київ": {
        "Біла Церква": 1,
        "Бердянськ": 3,
        "Вінниця": 1,
        "Дніпро": 2,
        "Житомир": 1,
        "Запоріжжя": 2,
        "Івано-Франківськ": 2,
        "Кам’янець Подільский": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 2,
        "Кропивницький": 1,
        "Луцьк": 2,
        "Львів": 2,
        "Маріуполь": 3,
        "Мелітополь": 3,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 1,
        "Слов’янськ": 3,
        "Суми": 2,
        "Тернопіль": 2,
        "Ужгород": 3,
        "Харків": 2,
        "Херсон": 2,
        "Хмельницький": 1,
        "Черкаси": 1,
        "Чернігів": 1,
        "Чернівці": 2
    },
    "Кременчуг": {
        "Біла Церква": 1,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 2,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 3,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 2,
        "Миколаїв": 1,
        "Одеса": 2,
        "Полтава": 1,
        "Рівне": 3,
        "Слов’янськ": 2,
        "Суми": 1,
        "Тернопіль": 3,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 2,
        "Хмельницький": 2,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 3
    },
    "Кривий Ріг": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 2,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 2,
        "Кременчуг": 1,
        "Кропивницький": 1,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 1,
        "Миколаїв": 1,
        "Одеса": 1,
        "Полтава": 1,
        "Рівне": 3,
        "Слов’янськ": 2,
        "Суми": 2,
        "Тернопіль": 2,
        "Ужгород": 3,
        "Харків": 2,
        "Херсон": 1,
        "Хмельницький": 2,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 3
    },
    "Кропивницький": {
        "Біла Церква": 1,
        "Бердянськ": 2,
        "Вінниця": 1,
        "Дніпро": 1,
        "Житомир": 2,
        "Запоріжжя": 1,
        "Івано-Франківськ": 3,
        "Кам’янець Подільский": 2,
        "Київ": 1,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Луцьк": 3,
        "Львів": 3,
        "Маріуполь": 2,
        "Мелітополь": 2,
        "Миколаїв": 1,
        "Одеса": 1,
        "Полтава": 1,
        "Рівне": 2,
        "Слов’янськ": 2,
        "Суми": 2,
        "Тернопіль": 2,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 1,
        "Хмельницький": 2,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 2
    },
    "Луцьк": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 2,
        "Дніпро": 4,
        "Житомир": 1,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 2,
        "Кременчуг": 3,
        "Кривий Ріг": 4,
        "Кропивницький": 3,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 3,
        "Одеса": 3,
        "Полтава": 4,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 3,
        "Тернопіль": 1,
        "Ужгород": 2,
        "Харків": 4,
        "Херсон": 4,
        "Хмельницький": 1,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 2
    },
    "Львів": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 4,
        "Дніпро": 4,
        "Житомир": 2,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 2,
        "Кременчуг": 4,
        "Кривий Ріг": 4,
        "Кропивницький": 3,
        "Луцьк": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 4,
        "Одеса": 3,
        "Полтава": 4,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 4,
        "Тернопіль": 1,
        "Ужгород": 1,
        "Харків": 4,
        "Херсон": 4,
        "Хмельницький": 1,
        "Черкаси": 3,
        "Чернігів": 3,
        "Чернівці": 1
    },
    "Маріуполь": {
        "Біла Церква": 3,
        "Бердянськ": 1,
        "Вінниця": 4,
        "Дніпро": 1,
        "Житомир": 4,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 3,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 4,
        "Львів": 4,
        "Мелітополь": 1,
        "Миколаїв": 2,
        "Одеса": 3,
        "Полтава": 2,
        "Рівне": 4,
        "Слов’янськ": 1,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 2,
        "Хмельницький": 4,
        "Черкаси": 2,
        "Чернігів": 4,
        "Чернівці": 4
    },
    "Мелітополь": {
        "Біла Церква": 3,
        "Бердянськ": 1,
        "Вінниця": 3,
        "Дніпро": 1,
        "Житомир": 4,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 3,
        "Кременчуг": 2,
        "Кривий Ріг": 1,
        "Кропивницький": 2,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 1,
        "Миколаїв": 1,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 4,
        "Слов’янськ": 2,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 1,
        "Хмельницький": 4,
        "Черкаси": 3,
        "Чернігів": 3,
        "Чернівці": 4
    },
    "Миколаїв": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 2,
        "Запоріжжя": 3,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 2,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 3,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 1,
        "Одеса": 1,
        "Полтава": 2,
        "Рівне": 3,
        "Слов’янськ": 2,
        "Суми": 2,
        "Тернопіль": 3,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 1,
        "Хмельницький": 2,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 3
    },
    "Одеса": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 2,
        "Житомир": 2,
        "Запоріжжя": 2,
        "Івано-Франківськ": 2,
        "Кам’янець Подільский": 2,
        "Київ": 2,
        "Кременчуг": 2,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 3,
        "Львів": 3,
        "Маріуполь": 3,
        "Мелітополь": 2,
        "Миколаїв": 1,
        "Полтава": 2,
        "Рівне": 3,
        "Слов’янськ": 3,
        "Суми": 3,
        "Тернопіль": 3,
        "Ужгород": 4,
        "Харків": 3,
        "Херсон": 1,
        "Хмельницький": 2,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 3
    },
    "Полтава": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 2,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 2,
        "Миколаїв": 2,
        "Одеса": 2,
        "Рівне": 3,
        "Слов’янськ": 1,
        "Суми": 1,
        "Тернопіль": 3,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 2,
        "Хмельницький": 3,
        "Черкаси": 1,
        "Чернігів": 2,
        "Чернівці": 4
    },
    "Рівне": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 4,
        "Житомир": 1,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 1,
        "Кременчуг": 3,
        "Кривий Ріг": 3,
        "Кропивницький": 2,
        "Луцьк": 1,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 3,
        "Одеса": 3,
        "Полтава": 3,
        "Слов’янськ": 4,
        "Суми": 3,
        "Тернопіль": 1,
        "Ужгород": 2,
        "Харків": 3,
        "Херсон": 3,
        "Хмельницький": 1,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 1
    },
    "Слов’янськ": {
        "Біла Церква": 3,
        "Бердянськ": 2,
        "Вінниця": 4,
        "Дніпро": 1,
        "Житомир": 4,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 3,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 1,
        "Мелітополь": 2,
        "Миколаїв": 2,
        "Одеса": 3,
        "Полтава": 1,
        "Рівне": 4,
        "Суми": 2,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 2,
        "Хмельницький": 4,
        "Черкаси": 2,
        "Чернігів": 3,
        "Чернівці": 4
    },
    "Суми": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 2,
        "Житомир": 2,
        "Запоріжжя": 2,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 3,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 2,
        "Миколаїв": 2,
        "Одеса": 3,
        "Полтава": 1,
        "Рівне": 3,
        "Слов’янськ": 2,
        "Тернопіль": 3,
        "Ужгород": 4,
        "Харків": 1,
        "Херсон": 3,
        "Хмельницький": 3,
        "Черкаси": 1,
        "Чернігів": 1,
        "Чернівці": 4
    },
    "Тернопіль": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 4,
        "Житомир": 1,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 2,
        "Кременчуг": 3,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 1,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 3,
        "Одеса": 3,
        "Полтава": 3,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 3,
        "Ужгород": 2,
        "Харків": 4,
        "Херсон": 4,
        "Хмельницький": 1,
        "Черкаси": 4,
        "Чернігів": 2,
        "Чернівці": 1
    },
    "Ужгород": {
        "Біла Церква": 4,
        "Бердянськ": 4,
        "Вінниця": 3,
        "Дніпро": 4,
        "Житомир": 3,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 2,
        "Київ": 3,
        "Кременчуг": 4,
        "Кривий Ріг": 3,
        "Кропивницький": 4,
        "Луцьк": 2,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 4,
        "Одеса": 4,
        "Полтава": 4,
        "Рівне": 2,
        "Слов’янськ": 4,
        "Суми": 4,
        "Тернопіль": 2,
        "Харків": 4,
        "Херсон": 4,
        "Хмельницький": 2,
        "Черкаси": 4,
        "Чернігів": 4,
        "Чернівці": 2
    },
    "Харків": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 3,
        "Дніпро": 1,
        "Житомир": 3,
        "Запоріжжя": 1,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 4,
        "Київ": 2,
        "Кременчуг": 1,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 2,
        "Миколаїв": 2,
        "Одеса": 3,
        "Полтава": 1,
        "Рівне": 3,
        "Слов’янськ": 1,
        "Суми": 1,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Херсон": 2,
        "Хмельницький": 4,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 3
    },
    "Херсон": {
        "Біла Церква": 2,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 3,
        "Запоріжжя": 2,
        "Івано-Франківськ": 4,
        "Кам’янець Подільский": 3,
        "Київ": 2,
        "Кременчуг": 2,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 4,
        "Львів": 4,
        "Маріуполь": 2,
        "Мелітополь": 1,
        "Миколаїв": 1,
        "Одеса": 1,
        "Полтава": 2,
        "Рівне": 3,
        "Слов’янськ": 2,
        "Суми": 3,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 2,
        "Хмельницький": 3,
        "Черкаси": 2,
        "Чернігів": 3,
        "Чернівці": 3
    },
    "Хмельницький": {
        "Біла Церква": 1,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 3,
        "Житомир": 1,
        "Запоріжжя": 3,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 1,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 1,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 3,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 3,
        "Тернопіль": 1,
        "Ужгород": 2,
        "Харків": 4,
        "Херсон": 3,
        "Черкаси": 2,
        "Чернігів": 2,
        "Чернівці": 1
    },
    "Черкаси": {
        "Біла Церква": 1,
        "Бердянськ": 2,
        "Вінниця": 2,
        "Дніпро": 1,
        "Житомир": 1,
        "Запоріжжя": 2,
        "Івано-Франківськ": 3,
        "Кам’янець Подільский": 2,
        "Київ": 1,
        "Кременчуг": 1,
        "Кривий Ріг": 1,
        "Кропивницький": 1,
        "Луцьк": 2,
        "Львів": 3,
        "Маріуполь": 2,
        "Мелітополь": 3,
        "Миколаїв": 1,
        "Одеса": 2,
        "Полтава": 1,
        "Рівне": 2,
        "Слов’янськ": 2,
        "Суми": 1,
        "Тернопіль": 4,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 2,
        "Хмельницький": 2,
        "Чернігів": 1,
        "Чернівці": 2
    },
    "Чернігів": {
        "Біла Церква": 1,
        "Бердянськ": 4,
        "Вінниця": 2,
        "Дніпро": 2,
        "Житомир": 1,
        "Запоріжжя": 3,
        "Івано-Франківськ": 3,
        "Кам’янець Подільский": 2,
        "Київ": 1,
        "Кременчуг": 2,
        "Кривий Ріг": 2,
        "Кропивницький": 2,
        "Луцьк": 2,
        "Львів": 3,
        "Маріуполь": 4,
        "Мелітополь": 3,
        "Миколаїв": 2,
        "Одеса": 2,
        "Полтава": 2,
        "Рівне": 2,
        "Слов’янськ": 3,
        "Суми": 1,
        "Тернопіль": 2,
        "Ужгород": 4,
        "Харків": 2,
        "Херсон": 3,
        "Хмельницький": 2,
        "Черкаси": 1,
        "Чернівці": 3
    },
    "Чернівці": {
        "Біла Церква": 2,
        "Бердянськ": 4,
        "Вінниця": 1,
        "Дніпро": 2,
        "Житомир": 2,
        "Запоріжжя": 4,
        "Івано-Франківськ": 1,
        "Кам’янець Подільский": 1,
        "Київ": 2,
        "Кременчуг": 3,
        "Кривий Ріг": 3,
        "Кропивницький": 2,
        "Луцьк": 2,
        "Львів": 1,
        "Маріуполь": 4,
        "Мелітополь": 4,
        "Миколаїв": 3,
        "Одеса": 3,
        "Полтава": 4,
        "Рівне": 1,
        "Слов’янськ": 4,
        "Суми": 4,
        "Тернопіль": 1,
        "Ужгород": 2,
        "Харків": 3,
        "Херсон": 3,
        "Хмельницький": 1,
        "Черкаси": 2,
        "Чернігів": 3
    }
}

const tariffs = {
    addressTakeOrDeliveryRate : [
         {
            minWeight: 0,
            maxWeight: 1,
            price: 15
        },
         {
            minWeight: 1,
            maxWeight: 5,
            price: 18
        },
         {
            minWeight: 5,
            maxWeight: 10,
            price: 20
        },
         {
            minWeight: 10,
            maxWeight: 30,
            price: 22
        }
    ],
    packadge: {
            "comfort-pass": [
                {
                   minweight: 0,
                   maxweight: 0.5,
                   price: 14
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 17
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 19
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 21
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 27
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 36
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 50
               },
           ] ,
           "city-limits": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 25
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 30
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 35
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 38
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 49
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 65
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 90
               },
           ],
           "across-Ukraine": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 33
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 37
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 42
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 47
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 57
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 75
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 95
               },
           ],
           "region-limit": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 30
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 35
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 40
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 45
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 55
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 70
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 95
               },
           ]
    },
    load: {
            "comfort-pass": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 14
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 17
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 19
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 21
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 27
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 36
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 50
               },
           ] ,
           "city-limits": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 25
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 30
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 35
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 38
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 49
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 65
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 90
               },
           ],
           "across-Ukraine": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 33
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 37
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 42
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 47
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 57
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 75
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 95
               },
           ],
           "region-limit": [
                {
                   minweight: 0,
                   maxweight:0.5,
                   price: 30
               },
                {
                   minweight: 0.5,
                   maxweight:1,
                   price: 35
               },
                {
                   minweight: 1,
                   maxweight:2,
                   price: 40
               },
                {
                   minweight: 2,
                   maxweight:5,
                   price: 45
               },
                {
                   minweight: 5,
                   maxweight:10,
                   price: 55
               },
                {
                   minweight: 10,
                   maxweight:15,
                   price: 70
               },
                {
                   minweight: 15,
                   maxweight:30,
                   price: 95
               },
           ]
        
    },  
    pallet: {
        "0.48": {
            "comfort-pass": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 200
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 300
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 400
                },
            ],
            "city-limits": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 300
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 450
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 700
                },
            ],
            "across-Ukraine": [
                zoneNumber1 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 460
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 650
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1000
                    },
                ],
                zoneNumber2 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 510
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 850
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1100
                    },
                ],
                zoneNumber3 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 700
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 850
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1300
                    },
                ],
                zoneNumber4 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 780
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1100
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1700
                    },
                ],
            ],
            "region-limit": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 375
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 550
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 850
                },
            ]
        },
        "0.96": {
            "comfort-pass": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 300
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 400
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 500
                },
            ],
            "city-limits": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 470
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 560
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 700
                },
            ],
            "across-Ukraine": [
                zoneNumber1 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 750
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 900
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1100
                    },
                ],
                zoneNumber2 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 900
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1100
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1300
                    },
                ],
                zoneNumber3 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 1000
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1300
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1500
                    },
                ],
                zoneNumber4 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 1150
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1500
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1700
                    },
                ],
            ],
            "region-limit": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 575
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 700
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 875
                },
            ]
        },
        "2": {
            "comfort-pass": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 350
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 400
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 500
                },
            ],
            "city-limits": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 525
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 600
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 800
                },
            ],
            "across-Ukraine": [
                zoneNumber1 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 850
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1050
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1250
                    },
                ],
                zoneNumber2 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 1100
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1300
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1500
                    },
                ],
                zoneNumber3 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 1250
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1450
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 1650
                    },
                ],
                zoneNumber4 = [
                     {
                        minweight: 0,
                        maxweight: 500,
                        price: 1400
                    },
                     {
                        minweight: 500,
                        maxweight: 750,
                        price: 1650
                    },
                     {
                        minweight: 750,
                        maxweight: 1000,
                        price: 2050
                    },
                ],
            ],
            "region-limit": [
                 {
                    minweight: 0,
                    maxweight: 500,
                    price: 600
                },
                 {
                    minweight: 500,
                    maxweight: 750,
                    price: 780
                },
                 {
                    minweight: 750,
                    maxweight: 1000,
                    price: 950
                },
            ]
        }
    }
        
};



const initialData = {
    weightData: 0,
    lengthData: 0,
    widthData: 0,
    heightData: 0,
    sendingTypeData: "packadge",
    sendingRangeData: "comfort-pass",
    insurancePay: 0,
    CODres: 0,
    CODpay: 0,
    addressTakeCheck: "False",
    addressDeliveryCheck: "False",
    sendCityValue: "",
    deliveryCityValue: undefined,
    volumeKnownData: 0,
    cities: cities,
    palletType: "0.48"
};


const weight = document.querySelector(".weight");
const volume = document.querySelector(".volume");
const lengthfield = document.querySelector(".input_length-field");
const width = document.querySelector(".input_width-field");
const height = document.querySelector(".input_height-field");
const sendingType = document.querySelector(".sendingType");
const insurance = document.querySelector(".insurance");
const COD = document.querySelector(".COD");
const sendCity = document.querySelector(".sendCity");
const deliveryCity = document.querySelector(".deliveryCity");
const sendDeliveryCity = document.querySelector(".sendDeliveryCity_block");
const comfortPass = document.querySelector(".comfort-pass_radio");
const cityLimits = document.querySelector(".city-limits_radio");
const acrossUkraine = document.querySelector(".across-Ukraine_radio");
const regionLimit = document.querySelector(".region-limit_radio");
const addressTake = document.querySelector(".address-take_radio");
const addressDelivery = document.querySelector(".address-delivery_radio");
const tinypallet = document.querySelector(".tiny-pallet");
const mediumpallet = document.querySelector(".middle-pallet");
const largepallet = document.querySelector(".large-pallet");
const palletContainer = document.querySelector(".palletType-container");
const volumeCalc = document.querySelector(".volume-calc");
const calcInput = document.querySelector(".volume-calcInput-container");
const calcCont = document.querySelector(".volume-calculate_container");
const dimentionsBtn = document.querySelector(".dimentions_submit");
const volumeFields = document.querySelector(".volume-fields_block");
const dimentionInput = document.querySelector(".input_dimention-block");
const lengthInput = document.querySelector(".input_length-field");
const widthInput = document.querySelector(".input_width-field");
const heightInput = document.querySelector(".input_height-field");
const resultBlock = document.querySelector(".result_block");
const mainCont = document.querySelector(".calc_container");
const resultbtn = document.querySelector(".resultbtn");
const resultDisplay = document.querySelector(".result-display");
const rateDisplay = document.querySelector(".rate");
const insuranceDisplay = document.querySelector(".insurancePay");
const CODDisplay = document.querySelector(".CODpay");
const addressTakeDisplay = document.querySelector(".addressTakeDisplay");
const addressDeliveryDisplay = document.querySelector(".addressDeliveryDisplay");
const inputvolumeBlock = document.querySelector(".input-block_miniweightvolume");
const calcText = document.querySelector(".calc-text");
const calcImage = document.querySelector(".calc-image");
const buttonCont = document.querySelector(".resultBtn-container");
const sendID = document.querySelector(".input-block_miniUpLeft");
const sendContID = document.querySelector(".input-block_sideLeft");
let screenWidth = document.querySelector(".main").offsetWidth;

 

sendingRangecheck(initialData);

window.addEventListener("resize", resize);
function resize(){
    screenWidth = document.querySelector(".main").offsetWidth;
    console.log(screenWidth);
    changeDimentions();
}


mainCont.addEventListener("change", function (event){inputInsert(event, preparedData, sendingRangecheck)});

function inputInsert(event, data, func){
    if(event.target == weight){
        data.weightData = event.target.value;
    }
    if(event.target == volume){
        data.volumeKnownData = volume.value;
    }
    if(event.target == lengthfield){
        data.lengthData = lengthfield.value;
    }
    if(event.target == width){
        data.widthData = width.value;
    }
    if(event.target == height){
        data.heightData = height.value;
    }
    if(event.target == sendingType){
        data.sendingTypeData = sendingType.value;
    }
    if(event.target == addressTake){
        data.addressTakeCheck = addressTake.checked ? "True" : "False" ;
    }
    if(event.target == addressDelivery){
        data.addressDeliveryCheck = addressDelivery.checked ? "True" : "False" ;
    }
    if(event.target == tinypallet){
        if(tinypallet.checked){
            data.palletType = tinypallet.value;
        }
    }
    if(event.target == mediumpallet){
        if(mediumpallet.checked){
            data.palletType = mediumpallet.value;
        }
    }
    if(event.target == largepallet){
        if(largepallet.checked){
            data.palletType = largepallet.value;
        }
    }
    if(event.target == comfortPass || event.target == cityLimits || event.target == acrossUkraine || event.target == regionLimit){
        func(data);
    }
    if(event.target == insurance){
        data.insurancePay = insurance.value > 200 ? insurance.value*0.005 : 0 ;
    }
    if(event.target == COD){
        data.CODres = (COD.value*0.02) +15;
    }
    if(event.target == sendCity){
        data.sendCityValue = sendCity.value;

        let delCity = function(arr){
            let modyfiedArr = [];
            for(let key in arr){
                if(data.sendCityValue != key){
                    modyfiedArr.push(key);
                };
            };
            return modyfiedArr;
        };
    
        let deliveryElemArr = delCity(cities);
    
        deliveryElemArr.forEach((elem) => {
            let deliveryElem = document.createElement('option');
            deliveryElem.innerHTML = elem;
            deliveryCity.append(deliveryElem);
        }); 
    }
    if(event.target == deliveryCity){
        data.deliveryCityValue = deliveryCity.value;
    }
    check(data);
    
}

function sendingRangecheck(data){
    if(comfortPass.checked){
        data.sendingRangeData = comfortPass.value;
        sendDeliveryCity.style.display = "none";
        changeDimentions();
    }else if(cityLimits.checked){
        data.sendingRangeData = cityLimits.value;
        sendDeliveryCity.style.display = "none";
        changeDimentions();
    }else if(acrossUkraine.checked){
        data.sendingRangeData = acrossUkraine.value;
        sendDeliveryCity.style.display = "flex";
        changeDimentions();
    }else if(regionLimit.checked){
        data.sendingRangeData = regionLimit.value;
        sendDeliveryCity.style.display = "none";
        changeDimentions();
    }
    changeDimentions();
    return data.sendingRangeData;
}

function changeDimentions(){
    if(500 < screenWidth && screenWidth < 800){
        if(acrossUkraine.checked){
            sendID.style.height = "230px";
            sendContID.style.minheight = "390px";
        }else{
            sendID.style.height = "150px";
            sendContID.style.minheight = "320px";
        };
    };
    if(300 < screenWidth && screenWidth < 500){
        if(acrossUkraine.checked){
            sendID.style.height = "270px";
            sendContID.style.minheight = "390px";
        }else{
            sendID.style.height = "150px";
            sendContID.style.minheight = "320px";
        };
    };
    if(screenWidth > 800){
        sendID.style.height = "230px";
        sendContID.style.minheight = "390px";
    };
};

inputvolumeBlock.addEventListener("click", function(event){inputInsertOnclick(event, preparedData)});


function inputInsertOnclick(event, data){
    if(event.target == dimentionsBtn){
        
        data.volumeKnownData = (data.lengthData*data.widthData*data.heightData)/1000000;
        volume.value = data.volumeKnownData;
        volume.innerHTML = data.volumeKnownData;
        calcInput.style.display = "none";
        calcCont.style.display = "flex";
    }
    if(event.target == calcText || event.target == calcImage){
        calcInput.style.display = "flex";
        calcCont.style.display = "none";
        data.volumeKnownData = 0;
        volume.value = 0;
        volume.innerHTML = data.volumeKnownData;
        if(300 < screenWidth && screenWidth <850){
            buttonCont.style.height = "250px";
        }
    }
}

function check(data){
    if((data.sendingTypeData == "load") && (0 < data.volumeKnownData && data.volumeKnownData < 0.018)){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    }else if((data.sendingTypeData == "packadge") && (data.volumeKnownData > 0.018)){
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    }else if((data.sendingTypeData == "load" || data.sendingTypeData == "pallet") && (data.volumeKnownData > 4.32)){
        alert("Слишком большой объем");
        data.volumeKnownData = 0;
        volume.value = 0;
    }else if(data.volumeKnownData <0){
        alert("объем должен быть больше 0");
        data.volumeKnownData = 0;
        volume.value = 0;
    }
    
    palletContainer.style.display = data.sendingTypeData == "pallet" ? "flex" : "none" ;

    if( data.sendingTypeData == "load" && (0 > (+data.lengthData)+(+data.widthData)+(+data.heightData) && (+data.lengthData)+(+data.widthData)+(+data.heightData) < 120 )){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    };

    if( data.sendingTypeData == "packadge" && (+data.lengthData)+(+data.widthData)+(+data.heightData) > 120 ){
        alert ("сумма всех сторон должна быть меньше 120см");
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    };
    if( data.sendingTypeData == "load" && (+data.lengthData)+(+data.widthData)+(+data.heightData) > 540 ){
        alert ("сумма всех сторон должна быть меньше 540см");
        lengthfield.value = 0;
        width.value = 0;
        height.value = 0;
        data.lengthData = 0;
        data.widthData = 0;
        data.heightData = 0;
    };

    if(data.sendingTypeData == "load" && (0 < data.weightData && data.weightData < 30)){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    }else if(data.sendingTypeData == "packadge" && data.weightData > 30){
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    }else if(data.sendingTypeData == "load" && data.weightData > 1000){
        alert ("вес не должен быть больше 1000кг");
        weight.value = 0;
        data.weightData = 0;
    }else if(data.weightData <0){
        alert ("вес должен быть больше 0");
        weight.value = 0;
        data.weightData = 0;
    }

    if(data.sendingTypeData == "load" && (0 < data.lengthData && data.lengthData < 90)){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    }else if(data.sendingTypeData == "packadge" && data.lengthData > 90){
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    }else if(data.sendingTypeData == "load" && data.lengthData > 300){
        alert ("длина должна быть не больше 300см");
        lengthfield.value = 0;
        data.lengthData = 0;
    }else if(data.lengthData < 0){
        alert ("длина должна быть больше 0см");
        lengthfield.value = 0;
        data.lengthData = 0;
    }

    if(data.sendingTypeData == "load" && (0 < data.widthData && data.widthData < 90)){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    }else if(data.sendingTypeData == "packadge" && data.widthData > 90){
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    }else if(data.sendingTypeData == "load" && data.widthData > 150){
        alert ("ширина должна быть не больше 150см");
        width.value = 0;
        data.widthData = 0;
    }else if(data.widthData < 0){
        alert ("ширина должна быть больше 0см");
        width.value = 0;
        data.widthData = 0;
    }

    if( data.sendingTypeData == "load" && (0 < data.heightData && data.heightData < 90)){
        data.sendingTypeData = "packadge";
        sendingType.value = "packadge";
        document.querySelector("#packadge").selected = true;
    }else if( data.sendingTypeData == "packadge" && data.heightData > 90){
        data.sendingTypeData = "load";
        sendingType.value = "load";
        document.querySelector("#load").selected = true;
    }else if( data.sendingTypeData == "load" && data.heightData > 150){
        alert ("высота должна быть не больше 150см");
        height.value = 0;
        data.heightData = 0;
    }else if(data.heightData > 180){
        alert ("высота должна быть не больше 180см");
        height.value = 0;
        data.heightData = 0;
    }else if(data.heightData <0){
        alert ("высота должна быть больше 0см");
        height.value = 0;
        data.heightData = 0;
    }
}

let preparedData = {
    volumeWeigth: undefined,
    resultWeight: undefined,
    zoneNumber: undefined,
    zoneRate: undefined,
    addressTak: undefined,
    addressDel: undefined,
    weightData: initialData.weightData,
    volumeKnownData: initialData.volumeKnownData,
    lengthData: initialData.lengthData,
    widthData: initialData.widthData,
    heightData: initialData.heightData,
    sendingTypeData: initialData.sendingTypeData,
    addressTakeCheck: initialData.addressTakeCheck,
    addressDeliveryCheck: initialData.addressDeliveryCheck,
    palletType: initialData.palletType,
    sendingRangeData: initialData.sendingRangeData,
    insurancePay: initialData.insurancePay,
    CODres: initialData.CODres,
    sendCityValue: initialData.sendCityValue,
    deliveryCityValue: initialData.deliveryCityValue,
    cities: initialData.cities
}

function prepare(data){
    
    data.volumeWeigth = data.volumeKnownData*250;

    data.resultWeight = data.volumeWeigth>data.weightData ? data.volumeWeigth : data.weightData ;
    
    if(data.sendingRangeData == "across-Ukraine"){
        data.zoneNumber = data.cities[data.sendCityValue][data.deliveryCityValue];
    };
    

    if(data.zoneNumber == 1){
        data.zoneRate = 2.5;
    }else if(data.zoneNumber == 2){
        data.zoneRate = 3;
    }else if(data.zoneNumber == 3){
        data.zoneRate = 4;
    }else if(data.zoneNumber == 4){
        data.zoneRate = 5.5;
    }

    if(data.addressTakeCheck == "True"){
        if(data.sendingTypeData == "packadge" || data.sendingTypeData == "load"){
            if(data.resultWeight <= 1){
                data.addressTak = tariffs.addressTakeOrDeliveryRate[0].price;
            }else if((data.resultWeight > 1) && (data.resultWeight <= 5)){
                data.addressTak = tariffs.addressTakeOrDeliveryRate[1].price;
            }else if((data.resultWeight > 5) && (data.resultWeight <= 10)){
                data.addressTak = tariffs.addressTakeOrDeliveryRate[2].price;
            }else if((data.resultWeight > 10) && (data.resultWeight <= 30)){
                data.addressTak = tariffs.addressTakeOrDeliveryRate[3].price;
            }else if(data.resultWeight > 30){
                data.addressTak = ( tariffs.addressTakeOrDeliveryRate[3].price + (0.5 * (data.resultWeight - 30)));
            }
        }else{
            data.addressTak = 150;
        }
    }else{
        data.addressTak = 0;
    }

    if(data.addressDeliveryCheck == "True"){
        if(data.sendingTypeData == "packadge" || data.sendingTypeData == "load"){
            if(data.resultWeight <= 1){
                data.addressDel = tariffs.addressTakeOrDeliveryRate[0].price;
            }else if((data.resultWeight > 1) && (data.resultWeight <= 5)){
                data.addressDel = tariffs.addressTakeOrDeliveryRate[1].price;
            }else if((data.resultWeight > 5) && (data.resultWeight <= 10)){
                data.addressDel = tariffs.addressTakeOrDeliveryRate[2].price;
            }else if((data.resultWeight > 10) && (data.resultWeight <= 30)){
                data.addressDel = tariffs.addressTakeOrDeliveryRate[3].price;
            }else if(data.resultWeight > 30){
                data.addressDel = ( tariffs.addressTakeOrDeliveryRate[3].price + (0.5 * (data.resultWeight - 30)));
            }
        }else{
            data.addressDel = 150;
        }
    }else{
        data.addressDel = 0;
    }

    return data;
}

window.addEventListener("mouseup", function(event){
    if(event.target != calcInput && event.target != volumeFields && event.target != dimentionInput
        && event.target != lengthInput && event.target != widthInput && event.target != heightInput){
        calcInput.style.display = "none";
        calcCont.style.display = "flex";
    }
    
    if(300 < screenWidth && screenWidth <850 && event.target != calcInput && event.target != volumeFields && event.target != dimentionInput
        && event.target != lengthInput && event.target != widthInput && event.target != heightInput){
        buttonCont.style.height = "158px";
    }
});

resultbtn.addEventListener("click", function(){calc(preparedData)});

function calc(data){
    let resultData = {
        rate: undefined,
        addressTakeSum: undefined,
        addressDeliverySum: undefined,
        resultSum: undefined,
        CODSum: undefined,
        insuranceSum: undefined
    }

    
    prepare(data);
    

    function getPrice(obj, sendType, palletType, sendRange, zone, zoneRate, weight){

        for(let key in obj){
            if(sendType == key){
                let newObj = obj[key];
                if(sendType == "pallet"){
                    for(let prop in newObj){
                        let palletObj = newObj[prop];
                        if(prop == palletType){
                            for(let range in palletObj){
                                if(range == sendRange){
                                    let newArr = palletObj[range];
                                    if(range == "across-Ukraine"){
                                        newArr.forEach(function(elem){
                                            if(+newArr.indexOf(elem) == (zone -1)){
                                                getfromArr(elem, weight, sendRange, zoneRate, sendType);
                                            };
                                        } );
                                    }else{
                                        getfromArr(newArr, weight, sendRange, zoneRate, sendType);
                                    }
                                }
                                
                            }
                            
                        }
                    }
                                
                }else{
                    for(let prop in newObj){
                        let packadgeLoadArr = newObj[prop];
                        if(sendRange == prop){
                            getfromArr(packadgeLoadArr, weight, sendRange, zoneRate, sendType);
                        }   
                    }
                }
                
            }
        } 
    };

    function getfromArr(arr, weight, sendRange, zoneRate, sendType){
        if(sendType == "packadge" || sendType == "load"){
            if(weight < 30){
                arr.forEach(function(elem){
                    if(elem.minweight < weight && weight <= elem.maxweight){
                        resultData.rate = elem.price;   
                    } 
                })
            }else if(weight > 30){
                let price = 0;
                for(let i=0; i<arr.length; i++){
                    if(arr[i].price > price){
                        price = arr[i].price;
                    }
                }
                
                if(sendRange == "comfort-pass"){
                    resultData.rate = (price + (0.6*(weight -30)));
                }else if(sendRange == "city-limits"){
                    resultData.rate = (price + (1.4*(weight -30)));
                }else if(sendRange == "region-limit"){
                    resultData.rate = (price + (1.9*(weight -30)));
                }else if(sendRange == "across-Ukraine"){
                    resultData.rate = (price + (zoneRate*(weight -30)));
                }
            }
        }else{
            arr.forEach(function(elem){
                if(elem.minweight < weight && weight <= elem.maxweight){
                    resultData.rate = (elem.price);   
                } 
            })
        }
    }

    if(data.weightData <= 0 ){
        alert("введите корректные данные");
        return;
    }

    getPrice( tariffs, data.sendingTypeData, data.palletType, data.sendingRangeData, data.zoneNumber, data.zoneRate, data.resultWeight);
    
    
    

    resultData.addressTakeSum = preparedData.addressTak;
    resultData.addressDeliverySum = preparedData.addressDel;
    resultData.rate = Math.ceil(resultData.rate);
    resultData.resultSum = (resultData.rate + resultData.addressTakeSum + resultData.addressDeliverySum + data.insurancePay + data.CODres);
    resultData.CODSum = preparedData.CODres;
    resultData.insuranceSum = preparedData.insurancePay;

    render(resultData);
    
    resultBlock.style.display = "flex";
    resultbtn.innerHTML = "ПЕРЕСЧИТАТЬ";
    
}

function render(data)
{
    resultDisplay.innerHTML = data.resultSum > 0 ? data.resultSum : "-";
    rateDisplay.innerHTML = data.rate > 0 ? data.rate : "-";
    insuranceDisplay.innerHTML = data.insuranceSum > 0 ? data.insuranceSum : "-";
    CODDisplay.innerHTML = data.CODSum > 0 ? data.CODSum : "-";
    addressTakeDisplay.innerHTML = data.addressTakeSum > 0 ? data.addressTakeSum : "-";
    addressDeliveryDisplay.innerHTML = data.addressDeliverySum > 0 ? data.addressDeliverySum : "-";
}


let delCity = function(cityArr, city){
    let arrException = cityArr;
    delete arrException[city];
    return arrException;
}


let deliveryArr = delCity(cities, initialData.sendCityValue);


for(let key in cities){
    let sendElem = document.createElement('option');
    sendElem.innerHTML = key;
    sendCity.append(sendElem);
}

/*fetch('http://localhost:5000/get-data')
.then(answer => answer.json())
.then(answer => console.log(answer))*/